src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Роли</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Пользователи/ObjectModule.bsl
Процедура ПередЗаписью ( Отказ )

	Если ( ОбменДанными.Загрузка ) Тогда
		Возврат;
	КонецЕсли;
	Отказ = проверитьВыбранныеПрава ();
	Если ( Отказ ) Тогда
		Возврат;		
	КонецЕсли;
	Если ( НЕ ЗначениеЗаполнено ( ИдентификаторПользователяИБ ) ) Тогда
		создатьПользователяИБ ();
	КонецЕсли;

КонецПроцедуры

Функция проверитьВыбранныеПрава ()
	
	ошибка = Ложь;
	колвоВыбранных = 0;
	Для Каждого строкаТЧ Из Роли Цикл
		Если ( строкаТЧ.Использование ) Тогда
			колвоВыбранных = колвоВыбранных + 1;
			Если ( строкаТЧ.Роль = "Пользователь" И Контрагент = Справочники.Контрагенты.ПустаяСсылка () ) Тогда
				ошибка = Истина;
				Сообщить ( "Выбрана роль ""Пользователь"". Необходимо выбрать контрагента!", СтатусСообщения.Важное );
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если ( НЕ ошибка И колвоВыбранных = 0 ) Тогда
		Сообщить ( "Не выбрана ни одна роль!", СтатусСообщения.Важное );
		ошибка = Истина;
	КонецЕсли;		
	Возврат ошибка

КонецФункции

Процедура создатьПользователяИБ ()
	
	пользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени ( Наименование );
	Если ( пользовательИБ = Неопределено ) Тогда
		пользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя ();		
	КонецЕсли;
	пользовательИБ.РазделениеДанных = Новый Структура ( "Контрагент", Контрагент.Код );
	пользовательИБ.СохраняемоеЗначениеПароля = Справочники.Пользователи.ПолучитьХешПароля ( Пароль );
	пользовательИБ.ПоказыватьВСпискеВыбора = Ложь;
	пользовательИБ.Имя = Наименование;
	пользовательИБ.ПолноеИмя = НаименованиеПолное;
	пользовательИБ.Роли.Очистить ();
	Для Каждого строкаТЧ Из Роли Цикл
		Если ( строкаТЧ.Использование ) Тогда
			пользовательИБ.Роли.Добавить ( Метаданные.Роли [ строкаТЧ.Роль ] );
		КонецЕсли;
	КонецЦикла;
	пользовательИБ.Записать ();
	ИдентификаторПользователяИБ = пользовательИБ.УникальныйИдентификатор;
			
КонецПроцедуры

Процедура ПриЗаписи ( Отказ )
	
	Если ( ОбменДанными.Загрузка ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании ( ОбъектКопирования )
	
	Контрагент = Справочники.Контрагенты.ПустаяСсылка ();
	ИдентификаторПользователяИБ = Неопределено;	

КонецПроцедуры
